Repository: sajjadstation19-cloud/date_converter_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Date Converter
ar: محوّل التاريخ

source: Settings
ar: الإعدادات

source: Home
ar: الرئيسية

# todayGregorianTitle
source: Gregorian Date
ar: التاريخ الميلادي

# todayHijriTitle
source: Hijri Date
ar: التاريخ الهجري

source: Convert from Gregorian
ar: تحويل من الميلادي

source: Convert from Hijri
ar: تحويل من الهجري

source: Convert
ar: تحويل

source: Day
ar: اليوم

source: Month
ar: الشهر

source: Year
ar: السنة

# moreButton
source: More
ar: المزيد

# watchAdReward
source: Watch Ad to Earn Reward
ar: شاهد إعلان لتحصل على مكافأة

source: Close
ar: إغلاق

# system
source: System Default
ar: افتراضي النظام

source: Language
ar: اللغة

# languageArabic
source: Arabic
ar: العربية

# languageEnglish
source: English
ar: الإنجليزية

source: Theme
ar: المظهر

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

# themeSystem
source: System
ar: حسب النظام

# noteAccuracy
source: Dates may not be 100% accurate.
ar: قد لا تكون التواريخ دقيقة 100٪.

source: Copy
ar: نسخ

source: Share
ar: مشاركة

source: Export
ar: تصدير

source: Export failed
ar: فشل في التصدير

# exportSuccess
source: Export successful
ar: تم التصدير بنجاح

# resultWeekday
source: Weekday
ar: اليوم

# resultHijri
source: Hijri
ar: هجري

# resultGregorian
source: Gregorian
ar: ميلادي

source: Occasion
ar: المناسبة

# selectAllFields
source: Please select day, month, and year.
ar: يرجى اختيار اليوم والشهر والسنة.

# resultTitle
source: Conversion Result
ar: نتيجة التحويل

# todayWord
source: Today
ar: اليوم

source: Hijri New Year
ar: رأس السنة الهجرية

# hijriAshura
source: Ashura
ar: عاشوراء

# hijriArbaeen
source: Arbaeen of Imam Hussein
ar: أربعينية الإمام الحسين

# hijriProphetDeath
source: Prophet Muhammad's Death
ar: وفاة النبي ﷺ

# hijriProphetBirthday
source: Prophet Muhammad's Birthday
ar: مولد النبي ﷺ

# hijriAliBirthday
source: Imam Ali's Birthday
ar: مولد الإمام علي (ع)

# hijriIsraMiraj
source: Isra and Mi'raj / Mab'ath
ar: الإسراء والمعراج / المبعث النبوي

# hijriMidShaban
source: Mid-Sha'ban Night
ar: ليلة النصف من شعبان

# hijriRamadanStart
source: Start of Ramadan
ar: بداية شهر رمضان

# hijriBadr
source: Battle of Badr
ar: غزوة بدر الكبرى

# hijriAliMartyrdom
source: Martyrdom of Imam Ali
ar: استشهاد الإمام علي (ع)

# hijriEidFitr
source: Eid al-Fitr
ar: عيد الفطر

# hijriTarwiyah
source: Day of Tarwiyah
ar: يوم التروية

# hijriArafah
source: Day of Arafah
ar: يوم عرفة

# hijriEidAdha
source: Eid al-Adha
ar: عيد الأضحى

# hijriGhadir
source: Eid al-Ghadir
ar: عيد الغدير

# gregNewYear
source: New Year's Day
ar: رأس السنة الميلادية

# gregEpiphany
source: Epiphany
ar: عيد الغطاس

# gregOrthodoxChristmas
source: Orthodox Christmas
ar: عيد الميلاد الأرثوذكسي

# gregMartinLutherKingBirthday
source: Martin Luther King Jr. Birthday
ar: ميلاد مارتن لوثر كينغ

# gregWorldCancerDay
source: World Cancer Day
ar: اليوم العالمي للسرطان

# gregValentinesDay
source: Valentine's Day
ar: عيد الحب

# gregInternationalWomensDay
source: International Women's Day
ar: اليوم العالمي للمرأة

# gregEinsteinBirthday
source: Albert Einstein's Birthday
ar: ميلاد ألبرت أينشتاين

# gregPoetryDay
source: World Poetry Day
ar: اليوم العالمي للشعر

# gregAprilFools
source: April Fools' Day
ar: كذبة أبريل

# gregWorldHealthDay
source: World Health Day
ar: يوم الصحة العالمي

# gregBaghdadFall2003
source: Fall of Baghdad (2003)
ar: سقوط بغداد 2003

# gregYuriGagarin
source: First Space Flight - Yuri Gagarin
ar: أول رحلة فضائية - يوري غاغارين

# gregTitanicSinking
source: Titanic Sinking
ar: غرق سفينة تيتانك

# gregLaborDay
source: International Workers' Day
ar: عيد العمال

# gregNakba
source: Nakba Day (Palestine)
ar: ذكرى النكبة الفلسطينية

# gregWorldEnvironmentDay
source: World Environment Day
ar: اليوم العالمي للبيئة

# gregWorldMusicDay
source: World Music Day
ar: اليوم العالمي للموسيقى

# gregUSAIndependence
source: US Independence Day
ar: استقلال الولايات المتحدة

# gregMoonLanding
source: Moon Landing
ar: هبوط الإنسان على القمر

# gregHiroshima
source: Hiroshima Bombing
ar: قصف هيروشيما بالقنبلة الذرية

# gregNagasaki
source: Nagasaki Bombing
ar: قصف ناغازاكي بالقنبلة الذرية

# greg9_11
source: September 11 Attacks
ar: هجمات 11 سبتمبر

# gregPeaceDay
source: International Day of Peace
ar: اليوم العالمي للسلام

# gregElderlyDay
source: International Day of Older Persons
ar: اليوم العالمي للمسنين

# gregSputnik
source: Sputnik Launch
ar: إطلاق سبوتنك

# gregFoodDay
source: World Food Day
ar: يوم الغذاء العالمي

# gregBerlinWallFall
source: Fall of the Berlin Wall
ar: سقوط جدار برلين

# gregWW1End
source: End of World War I
ar: نهاية الحرب العالمية الأولى

# gregWorldAidsDay
source: World AIDS Day
ar: اليوم العالمي للإيدز

# gregHumanRightsDay
source: Human Rights Day
ar: اليوم العالمي لحقوق الإنسان

# gregChristmas
source: Christmas
ar: عيد الميلاد

# gregNewYearsEve
source: New Year's Eve
ar: ليلة رأس السنة الميلادية
